go/wrk_go.log
Running 10s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.06ms   23.21ms 180.92ms   81.87%
    Req/Sec     4.37k   838.32    11.92k    71.62%
  523170 requests in 10.05s, 89.81MB read
Requests/sec:  52072.07
Transfer/sec:      8.94MB