go/wrk_go.log
Running 10s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.46ms   27.93ms 222.38ms   80.79%
    Req/Sec     3.58k   777.92     8.17k    71.17%
  428795 requests in 10.03s, 73.61MB read
Requests/sec:  42761.25
Transfer/sec:      7.34MB